
Should be possible to pass intrinsics as arguments 
| (def f (op) (op 1 2))
> (f +)
= 3

| (def f (op) (op 1 2))
> (f -)
= -1

| (def f (op) (op 1 2))
> (f *)
= 2

| (def f (op) (op 1 2))
> (f /)
= 0

| (def f (op) (op 1 2))
> (f %)
= 1

| (def f (op) (op 1 2))
> (f /)
= 0
